Implement Monad in Language with Coroutine.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-12 Wed 00:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Implement Monad in Language with Coroutine</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="css/worg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://freebirdljj.github.io"> UP </a>
 |
 <a accesskey="H" href="https://freebirdljj.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Implement Monad in Language with Coroutine</h1>
<p>
Haskell 的 monad 配合上 do notation 的语法糖在实际中可以节省若干代码（类似 golang 的 error check）或从回调地狱中逃离。
这么有用的语言特性当然也希望在别的编程语言中也能享受到。
</p>

<p>
在 Haskell 中 do notation 将回调风格的程序包装为普通的非回调的形式，而在其它的编程语言里 coroutine 则是用来处理回调地狱的好办法。
所以可以考虑用 coroutine 来模拟这套机制。
</p>

<p>
举个例子，比如下面这段程序：
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">eitherSample</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Either</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
<span style="color: #bc6ec5; font-weight: bold;">eitherSample</span> n <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  <span style="color: #4f97d7; font-weight: bold;">let</span> r <span style="color: #7590db;">=</span> fromIntegral n
  x <span style="color: #7590db;">&lt;-</span> safeDivide <span style="color: #a45bad;">100.0</span> r
  y <span style="color: #7590db;">&lt;-</span> safeSqrt x
  <span style="color: #4f97d7; font-weight: bold;">let</span> z <span style="color: #7590db;">=</span> ceiling y
  return z
  <span style="color: #4f97d7; font-weight: bold;">where</span> safeDivide <span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #a45bad;">0</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Left</span>  <span style="color: #2d9574;">"divided by 0!"</span>
        safeDivide a b <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Right</span> <span style="color: #4f97d7;">(</span>a <span style="color: #7590db;">/</span> b<span style="color: #4f97d7;">)</span>
        safeSqrt x <span style="color: #7590db;">|</span> x <span style="color: #7590db;">&lt;</span> <span style="color: #a45bad;">0</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Left</span>  <span style="color: #2d9574;">"negative number!"</span>
                   <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">True</span>  <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Right</span> <span style="color: #7590db;">$</span> sqrt x
</pre>
</div>

<p>
这里就用 lua 来表达一下思路。
其实就是将整个函数体用 <code>return runeither(function() ... end)</code> 包起来，并将原来的特殊的赋值 <code>&lt;-</code> (<code>&gt;&gt;=</code>) 改为 <code>coroutine.yield</code> 。
简单起见， <code>Either</code> 就直接用多值返回模拟，用第一个返回值表示 <code>Right</code> 而第二个返回值表示 <code>Left</code> ，之所以如此而不是反过来是因为这样恰好可以很方便地处理最后的 <code>return</code> 。
具体如下：
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">runeither</span><span style="color: #4f97d7;">(</span>f<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #7590db;">co</span> = <span style="color: #4f97d7;">coroutine</span>.<span style="color: #4f97d7;">create</span><span style="color: #4f97d7;">(</span>f<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #7590db;">_</span>, <span style="color: #7590db;">data</span>, <span style="color: #7590db;">err</span> = <span style="color: #4f97d7;">coroutine</span>.<span style="color: #4f97d7;">resume</span><span style="color: #4f97d7;">(</span>co<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #4f97d7;">coroutine</span>.<span style="color: #4f97d7;">status</span><span style="color: #4f97d7;">(</span>co<span style="color: #4f97d7;">)</span> ~= <span style="color: #2d9574;">"dead"</span> <span style="color: #4f97d7; font-weight: bold;">and</span> err == <span style="color: #a45bad;">nil</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
    _, data, err = <span style="color: #4f97d7;">coroutine</span>.<span style="color: #4f97d7;">resume</span><span style="color: #4f97d7;">(</span>co, data<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> data, err
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">eithersample</span><span style="color: #4f97d7;">(</span>n<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">safediv</span><span style="color: #4f97d7;">(</span>a, b<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> b == <span style="color: #a45bad;">0</span> <span style="color: #4f97d7; font-weight: bold;">then</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>, <span style="color: #2d9574;">"Divided by ZERO!"</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> a / b, <span style="color: #a45bad;">nil</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
  <span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">safesqrt</span><span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> x &lt; <span style="color: #a45bad;">0</span> <span style="color: #4f97d7; font-weight: bold;">then</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>, <span style="color: #2d9574;">"negative number!"</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">math</span>.<span style="color: #4f97d7;">sqrt</span><span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">)</span>, <span style="color: #a45bad;">nil</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> runeither<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">function</span><span style="color: #bc6ec5;">()</span>
    <span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #7590db;">x</span> = <span style="color: #4f97d7;">coroutine</span>.<span style="color: #4f97d7;">yield</span><span style="color: #bc6ec5;">(</span>safediv<span style="color: #2d9574;">(</span><span style="color: #a45bad;">100</span>.<span style="color: #a45bad;">0</span>, n<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #7590db;">y</span> = <span style="color: #4f97d7;">coroutine</span>.<span style="color: #4f97d7;">yield</span><span style="color: #bc6ec5;">(</span>safesqrt<span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #7590db;">z</span> = <span style="color: #4f97d7;">math</span>.<span style="color: #4f97d7;">ceil</span><span style="color: #bc6ec5;">(</span>y<span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> z
  <span style="color: #4f97d7; font-weight: bold;">end</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
当然 <code>runeither()</code> 可以进一步抽象，将 monad 的类型（例如本例中的 <code>Either</code> ）和 coroutine 的机制剥离，仅留下诸如 <code>bind</code> (<code>&gt;&gt;=</code>) 这样的接口当然更好，但这里主要就表示一下思路，就不展开了。
</p>

<p>
P.S. 在 Haskell 中 <code>Yield</code> 是一个 <code>Functor</code> ，而 <code>Coroutine (Yield a)</code> 是一个 <code>MonadTrans</code> ， <code>Coroutine (Yield a) m</code> 在 <code>m</code> 是一个 <code>Monad</code> 的情况下也是一个 <code>Monad</code> 。
这说明 monad 和 coroutine 很有些渊源。
</p>
</div>
</body>
</html>
